app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["created_at", "2023-08-30 10:25:02.676912"], ["updated_at", "2023-08-30 10:25:02.676912"]]
---
  def create
    @user = current_user
    @post = Post.find(params[:post_id])
    @like = Like.new(author_id: @user.id, post_id: @post.id)
    return unless @like.save