app/controllers/posts_controller.rb

  def index
    @user = User.find_by(id: params[:user_id])
    @posts = @user.posts.includes(:comments).paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]

  def show
    @post = Post.includes(:author, comments: :author).find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @post = Post.new(params.require(:post).permit(:title, :text))
    @user = current_user
    @post.author = @user
    @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    user = current_user
    @post = Post.find_by(id: params[:id], author_id: params[:user_id])
    @post.likes.destroy_all
    @post.comments.destroy_all

    if @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 AND "posts"."author_id" = $2 LIMIT $3  [["id", 2], ["author_id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 9]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]