app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @user = User.find_by(id: params[:user_id])

    @posts = @user.posts.includes(:comments)