app/models/comment.rb

UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-08-30 10:46:18.888067"], ["id", 1]]
---
  def update_comments_counter_for_post
    return unless post.present?

    post.update(comments_counter: post.comments_counter.to_i + 1)