app/models/like.rb

  def update_likes_counter_for_post
    return unless post.present?

    post.update(likes_counter: post.likes_counter.to_i + 1)
---
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-08-30 10:46:04.670678"], ["id", 1]]